import React from 'react'

const Texts = () => {
    return (
        <div>
            <div className="w-full max-w-[1440px] px-5 mx-auto">
                <h2 className='mb-[22px] font-inter text-2xl font-semibold uppercase'>
                    Основные сферы деятельности ООО «АГРО-ТЕХ» на данном этапе развития:
                </h2>
                <div className='mb-[22px] flex items-center justify-between'>
                    <div className='element relative flex items-center justify-between'>
                        <div className='ml-6 left-[10px] w-full max-w-[580px] font-inter text-2xl'>
                            Производство широкого модельного ряда опрыскивателей, разбрасывателей удобрений, техники для обработки почвы и прочего сельскохозяйственного оборудования и инвентаря
                        </div>
                    </div>
                    <div className='element relative flex items-center justify-between'>
                        <div className='ml-6 left-[10px] w-full max-w-[502px] font-inter text-2xl'>
                            Возведение каркасных и бескаркасных арочных сооружений для различных отраслей промышленности и сельского хозяйства
                        </div>
                    </div>
                </div>

                <div className='mb-[103px] space-y-6 font-inter text-2xl'>
                    <p className='font-semibold'>
                        Опираясь на зарубежный опыт, предприятие создает столь же качественные, недорогие и адаптированные к российским реалиям отечественные аналоги сельскохозяйственной техники.
                    </p>
                    <p>
                        Взвешенная ценовая политика, высокая надежность и производительность, и, как следствие – хорошая окупаемость, делают продукцию компании востребованной на всей территории России и стран ближнего зарубежья.
                    </p>
                    <span className='inline-block text-[#E10B20] text-[28px]'>
                        Все предлагаемые машины сертифицированы, во многих из них используются собственные запатентованные разработки.
                    </span>
                    <p>
                        Предприятие непрерывно развивается, наращивая производство. При этом, расширение ассортимента продукции происходит как за счет собственных ресурсов, так и благодаря тесному сотрудничеству с крупнейшими мировыми производителями сельхозтехники.
                    </p>
                    <p>
                        На сегодняшний день компания насчитывает более 90 сотрудников. Они задействованы как на производстве, так и в строительстве.
                    </p>
                    <p>
                        Административное управление компанией и разработка проектов поручены группе ведущих инженеров, имеющих уникальный опыт работы в ТАНТК им. Бериева.
                    </p>
                    <p>
                        За время своего существования предприятие получило огромный опыт работы с клиентами, приобрело многолетний опыт проектирования, производства и строительства различных видов быстровозводимых конструкций, внесло неоценимый вклад в разработку и внедрение новейшей сельхозтехники.
                    </p>
                    <p>
                        Компания имеет десятки фирм-партнеров как на территории России, так и в странах ближнего и дальнего зарубежья.
                    </p>
                </div>
            </div>
        </div>
    )
}

export default Texts